# Data Aggregation and Group Operations

In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 20

In [2]:
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc('figure', figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

## GroupBy Mechanics

In [17]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025
4    a  one  1.352917 -0.438570

In [4]:
df.groupby(df['key1'])

In [5]:
a = df.groupby(df['key1'])

In [6]:
for m, n in a:
    print(m)
    print(n)
    print()

a
  key1 key2     data1     data2
0    a  one -0.204708  1.393406
1    a  two  0.478943  0.092908
4    a  one  1.965781  1.246435

b
  key1 key2     data1     data2
2    b  one -0.519439  0.281746
3    b  two -0.555730  0.769023

In [7]:
grouped = df['data1'].groupby(df['key1'])
grouped

In [8]:
for m, n in grouped:
    print(m)
    print(n)
    print()

a
0   -0.204708
1    0.478943
4    1.965781
Name: data1, dtype: float64

b
2   -0.519439
3   -0.555730
Name: data1, dtype: float64

In [9]:
grouped.mean()

key1
a    0.746672
b   -0.537585
Name: data1, dtype: float64

In [10]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one     0.880536
      two     0.478943
b     one    -0.519439
      two    -0.555730
Name: data1, dtype: float64

In [11]:
means.unstack()

key2       one       two
key1
a     0.880536  0.478943
b    -0.519439 -0.555730

In [19]:
df

  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025
4    a  one  1.352917 -0.438570

In [20]:
df2 = df.copy()
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df2['states'] = states
df2['years'] = years
df2

  key1 key2     data1     data2      states  years
0    a  one  1.007189  0.886429        Ohio   2005
1    a  two -1.296221 -2.001637  California   2005
2    b  one  0.274992 -0.371843  California   2006
3    b  two  0.228913  1.669025        Ohio   2005
4    a  one  1.352917 -0.438570        Ohio   2006

In [21]:
df2['data1'].groupby([states, years]).mean()

California  2005   -1.296221
            2006    0.274992
Ohio        2005    0.618051
            2006    1.352917
Name: data1, dtype: float64

In [23]:
df

  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025
4    a  one  1.352917 -0.438570

In [24]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])
years = np.array([2005, 2005, 2006, 2005, 2006])
df['data1'].groupby([states, years]).mean()

California  2005   -1.296221
            2006    0.274992
Ohio        2005    0.618051
            2006    1.352917
Name: data1, dtype: float64

In [25]:
df

  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025
4    a  one  1.352917 -0.438570

In [26]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.354628 -0.517926
b     0.251952  0.648591

In [27]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   1.180053  0.223930
     two  -1.296221 -2.001637
b    one   0.274992 -0.371843
     two   0.228913  1.669025

In [28]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

### Iterating Over Groups

In [29]:
df

  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025
4    a  one  1.352917 -0.438570

In [30]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)
    print()

a
  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
4    a  one  1.352917 -0.438570

b
  key1 key2     data1     data2
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025

In [28]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print((k1, k2))
    print(group)
    print()

('a', 'one')
  key1 key2     data1     data2
0    a  one  1.007189  0.886429
4    a  one  1.352917 -0.438570

('a', 'two')
  key1 key2     data1     data2
1    a  two -1.296221 -2.001637

('b', 'one')
  key1 key2     data1     data2
2    b  one  0.274992 -0.371843

('b', 'two')
  key1 key2     data1     data2
3    b  two  0.228913  1.669025

In [31]:
dict(list(((1, 10), (2, 20), (3, 30))))

{1: 10, 2: 20, 3: 30}

In [32]:
pieces = dict(list(df.groupby('key1')))
pieces

{'a':   key1 key2     data1     data2
 0    a  one  1.007189  0.886429
 1    a  two -1.296221 -2.001637
 4    a  one  1.352917 -0.438570,
 'b':   key1 key2     data1     data2
 2    b  one  0.274992 -0.371843
 3    b  two  0.228913  1.669025}

In [33]:
pieces['b']

  key1 key2     data1     data2
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025

In [36]:
df

  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025
4    a  one  1.352917 -0.438570

In [37]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [38]:
grouped = df.groupby(df.dtypes, axis=1)

In [39]:
for dtype, group in grouped:
    print(dtype)
    print(group)
    print()

float64
      data1     data2
0  1.007189  0.886429
1 -1.296221 -2.001637
2  0.274992 -0.371843
3  0.228913  1.669025
4  1.352917 -0.438570

object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

### Selecting a Column or Subset of Columns

df.groupby('key1')['data1']
df.groupby('key1')[['data2']]

In [60]:
df.groupby('key1')['data1'].mean() #결과: 시리즈

key1
a    0.354628
b    0.251952
Name: data1, dtype: float64

In [61]:
df.groupby('key1')[['data2']].mean() #결과: DataFrame

         data2
key1
a    -0.517926
b     0.648591

df['data1'].groupby(df['key1'])
df[['data2']].groupby(df['key1'])

In [43]:
df['data1'].groupby(df['key1'])

In [43]:
df[['data1']].groupby(df['key1'])

In [67]:
df.groupby(df['key1'])['data2']

In [68]:
df.groupby(df['key1'])[['data2']]

In [63]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.223930
     two  -2.001637
b    one  -0.371843
     two   1.669025

In [65]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one     0.223930
      two    -2.001637
b     one    -0.371843
      two     1.669025
Name: data2, dtype: float64

In [49]:
type(df.groupby(['key1', 'key2'])[['data2']].mean())

pandas.core.frame.DataFrame

In [58]:
df.groupby(['key1', 'key2'])['data2'].mean()

key1  key2
a     one     0.223930
      two    -2.001637
b     one    -0.371843
      two     1.669025
Name: data2, dtype: float64

In [59]:
type(df.groupby(['key1', 'key2'])['data2'].mean())

pandas.core.series.Series

In [40]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped
s_grouped.mean()

key1  key2
a     one     0.223930
      two    -2.001637
b     one    -0.371843
      two     1.669025
Name: data2, dtype: float64

### Grouping with Dicts and Series

In [70]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
people

               a         b         c         d         e
Joe     0.286350  0.377984 -0.753887  0.331286  1.349742
Steve   0.069877  0.246674 -0.011862  1.004812  1.327195
Wes    -0.919262 -1.549106  0.022185  0.758363 -0.660524
Jim     0.862580 -0.010032  0.050009  0.670216  0.852965
Travis -0.955869 -0.023493 -2.304234 -0.652469 -1.218302

In [71]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values
people

               a         b         c         d         e
Joe     0.286350  0.377984 -0.753887  0.331286  1.349742
Steve   0.069877  0.246674 -0.011862  1.004812  1.327195
Wes    -0.919262       NaN       NaN  0.758363 -0.660524
Jim     0.862580 -0.010032  0.050009  0.670216  0.852965
Travis -0.955869 -0.023493 -2.304234 -0.652469 -1.218302

In [74]:
mapping = {'a': 'red', 'b': 'red',
           'c': 'blue', 'd': 'blue',
           'e': 'red', 'f' : 'orange'}

In [75]:
by_column = people.groupby(mapping, axis=1)
by_column.sum()

            blue       red
Joe    -0.422601  2.014076
Steve   0.992950  1.643745
Wes     0.758363 -1.579786
Jim     0.720225  1.705513
Travis -2.956703 -2.197664

In [76]:
map_series = pd.Series(mapping)
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [77]:
people

               a         b         c         d         e
Joe     0.286350  0.377984 -0.753887  0.331286  1.349742
Steve   0.069877  0.246674 -0.011862  1.004812  1.327195
Wes    -0.919262       NaN       NaN  0.758363 -0.660524
Jim     0.862580 -0.010032  0.050009  0.670216  0.852965
Travis -0.955869 -0.023493 -2.304234 -0.652469 -1.218302

In [78]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

### Grouping with Functions

In [82]:
people

               a         b         c         d         e
Joe     0.286350  0.377984 -0.753887  0.331286  1.349742
Steve   0.069877  0.246674 -0.011862  1.004812  1.327195
Wes    -0.919262       NaN       NaN  0.758363 -0.660524
Jim     0.862580 -0.010032  0.050009  0.670216  0.852965
Travis -0.955869 -0.023493 -2.304234 -0.652469 -1.218302

In [83]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.229668  0.367952 -0.703877  1.759864  1.542183
5  0.069877  0.246674 -0.011862  1.004812  1.327195
6 -0.955869 -0.023493 -2.304234 -0.652469 -1.218302

In [84]:
people.groupby(len, axis=1).sum()

               1
Joe     1.591475
Steve   2.636695
Wes    -0.821423
Jim     2.425738
Travis -5.154367

In [86]:
people

               a         b         c         d         e
Joe     0.286350  0.377984 -0.753887  0.331286  1.349742
Steve   0.069877  0.246674 -0.011862  1.004812  1.327195
Wes    -0.919262       NaN       NaN  0.758363 -0.660524
Jim     0.862580 -0.010032  0.050009  0.670216  0.852965
Travis -0.955869 -0.023493 -2.304234 -0.652469 -1.218302

In [85]:
key_list = ['one', 'one', 'one', 'two', 'two']
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.919262  0.377984 -0.753887  0.331286 -0.660524
  two  0.862580 -0.010032  0.050009  0.670216  0.852965
5 one  0.069877  0.246674 -0.011862  1.004812  1.327195
6 two -0.955869 -0.023493 -2.304234 -0.652469 -1.218302

### Grouping by Index Levels

In [87]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['cty', 'tenor'])
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [88]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.332610  1.074623  0.723642  0.690002  1.001543
1     -0.503087 -0.622274 -0.921169 -0.726213  0.222896
2      0.051316 -1.157719  0.816707  0.433610  1.010737
3      1.824875 -0.997518  0.850591 -0.131578  0.912414

In [90]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [91]:
hier_df.groupby(level='tenor', axis=1).count()

tenor  1  3  5
0      2  2  1
1      2  2  1
2      2  2  1
3      2  2  1

## Data Aggregation

In [ ]:
df
grouped = df.groupby('key1')
grouped['data1'].quantile(0.9)

In [ ]:
def peak_to_peak(arr):
    return arr.max() - arr.min()
grouped.agg(peak_to_peak)

In [ ]:
grouped.describe()

### Column-Wise and Multiple Function Application

In [ ]:
tips = pd.read_csv('examples/tips.csv')
# Add tip percentage of total bill
tips['tip_pct'] = tips['tip'] / tips['total_bill']
tips[:6]

In [ ]:
grouped = tips.groupby(['day', 'smoker'])

In [ ]:
grouped_pct = grouped['tip_pct']
grouped_pct.agg('mean')

In [ ]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

In [ ]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

In [ ]:
functions = ['count', 'mean', 'max']
result = grouped['tip_pct', 'total_bill'].agg(functions)
result

In [ ]:
result['tip_pct']

In [ ]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]
grouped['tip_pct', 'total_bill'].agg(ftuples)

In [ ]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'],
             'size' : 'sum'})

### Returning Aggregated Data Without Row Indexes

In [ ]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

## Apply: General split-apply-combine

In [ ]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]
top(tips, n=6)

In [ ]:
tips.groupby('smoker').apply(top)

In [ ]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

In [ ]:
result = tips.groupby('smoker')['tip_pct'].describe()
result
result.unstack('smoker')

f = lambda x: x.describe()
grouped.apply(f)

### Suppressing the Group Keys

In [ ]:
tips.groupby('smoker', group_keys=False).apply(top)

### Quantile and Bucket Analysis

In [ ]:
frame = pd.DataFrame({'data1': np.random.randn(1000),
                      'data2': np.random.randn(1000)})
quartiles = pd.cut(frame.data1, 4)
quartiles[:10]

In [ ]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(),
            'count': group.count(), 'mean': group.mean()}
grouped = frame.data2.groupby(quartiles)
grouped.apply(get_stats).unstack()

In [ ]:
# Return quantile numbers
grouping = pd.qcut(frame.data1, 10, labels=False)
grouped = frame.data2.groupby(grouping)
grouped.apply(get_stats).unstack()

### Example: Filling Missing Values with Group-Specific       Values

In [ ]:
s = pd.Series(np.random.randn(6))
s[::2] = np.nan
s
s.fillna(s.mean())

In [ ]:
states = ['Ohio', 'New York', 'Vermont', 'Florida',
          'Oregon', 'Nevada', 'California', 'Idaho']
group_key = ['East'] * 4 + ['West'] * 4
data = pd.Series(np.random.randn(8), index=states)
data

In [ ]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan
data
data.groupby(group_key).mean()

In [ ]:
fill_mean = lambda g: g.fillna(g.mean())
data.groupby(group_key).apply(fill_mean)

In [ ]:
fill_values = {'East': 0.5, 'West': -1}
fill_func = lambda g: g.fillna(fill_values[g.name])
data.groupby(group_key).apply(fill_func)

### Example: Random Sampling and Permutation

In [ ]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

deck = pd.Series(card_val, index=cards)

In [ ]:
deck[:13]

In [ ]:
def draw(deck, n=5):
    return deck.sample(n)
draw(deck)

In [ ]:
get_suit = lambda card: card[-1] # last letter is suit
deck.groupby(get_suit).apply(draw, n=2)

In [ ]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

### Example: Group Weighted Average and Correlation

In [ ]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a',
                                'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})
df

In [ ]:
grouped = df.groupby('category')
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])
grouped.apply(get_wavg)

In [ ]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True,
                       index_col=0)
close_px.info()
close_px[-4:]

In [ ]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [ ]:
rets = close_px.pct_change().dropna()

In [ ]:
get_year = lambda x: x.year
by_year = rets.groupby(get_year)
by_year.apply(spx_corr)

In [ ]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

### Example: Group-Wise Linear Regression

In [ ]:
import statsmodels.api as sm
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [ ]:
by_year.apply(regress, 'AAPL', ['SPX'])

## Pivot Tables and Cross-Tabulation

In [ ]:
tips.pivot_table(index=['day', 'smoker'])

In [ ]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker')

In [ ]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'],
                 columns='smoker', margins=True)

In [ ]:
tips.pivot_table('tip_pct', index=['time', 'smoker'], columns='day',
                 aggfunc=len, margins=True)

In [ ]:
tips.pivot_table('tip_pct', index=['time', 'size', 'smoker'],
                 columns='day', aggfunc='mean', fill_value=0)

### Cross-Tabulations: Crosstab

In [ ]:
from io import StringIO
data = """\
Sample  Nationality  Handedness
1   USA  Right-handed
2   Japan    Left-handed
3   USA  Right-handed
4   Japan    Right-handed
5   Japan    Left-handed
6   Japan    Right-handed
7   USA  Right-handed
8   USA  Left-handed
9   Japan    Right-handed
10  USA  Right-handed"""
data = pd.read_table(StringIO(data), sep='\s+')

In [ ]:
data

In [ ]:
pd.crosstab(data.Nationality, data.Handedness, margins=True)

In [ ]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

In [ ]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS

## Conclusion

In [50]:
df

  key1 key2     data1     data2
0    a  one  1.007189  0.886429
1    a  two -1.296221 -2.001637
2    b  one  0.274992 -0.371843
3    b  two  0.228913  1.669025
4    a  one  1.352917 -0.438570

In [54]:
df['data1']

0    1.007189
1   -1.296221
2    0.274992
3    0.228913
4    1.352917
Name: data1, dtype: float64

In [55]:
type(df['data1'])

pandas.core.series.Series

In [56]:
df[['data1']]

      data1
0  1.007189
1 -1.296221
2  0.274992
3  0.228913
4  1.352917

In [57]:
type(df[['data1']])

pandas.core.frame.DataFrame